gclem/esp8266_poolex_heatpump_controller/src/main.cpp
#include <Arduino.h>
#include <secrets.h>

#define HOST_NAME "esp8266_poolheater_controller"

// UART PROTOCOL — GPIO (Wemos D1 Mini)
// Câblage actuel : RO→D2, DI→D1, DE/RE→D5
#define UART_RTS 14  // GPIO14 = D5 : MAX485 DE/RE
#define UART_TX   5  // GPIO5  = D1 : MAX485 DI
#define UART_RX   4  // GPIO4  = D2 : MAX485 RO
#define PORT_SPEED 9600

// Protocol bus — trames identifiées par analyse live (mai 2026)
//
//  Cycle bus (~190ms) — pattern alternant :
//   [PAC→remote] [flags] [état ~14B][capteurs 9B] : trame complète
//   [remote→PAC] XX 04 FF ... (12B) : heartbeat télécommande, constant
//   [PAC→remote] FD XX ... (13B) : ACK PAC
//   ... (le cycle se répète)
//
//  Séparateur inter-trames : octets 0x01 (idle bus)
//
//  Structure trame PAC : [flag1: 00|80] [flag2 opt: FC|06|08|88|5C] <état> <capteurs 9B>
//  Les 9 DERNIERS octets = capteurs (terminés par FF FF) :
//    [0] water_in_temp    = ((0xFF - x) >> 3) & 0x3F
//    [1] air_ambient_temp = ((0xFF - x) >> 1) & 0x3F
//    [2] coil_temp        = ((0xFF - x) >> 1) & 0x3F
//    [3] gas_temp         = ((0xFF - x) >> 1) & 0x3F
//    [4] water_out_temp   = ((0xFF - x) >> 1) & 0x3F
//    [5] constant 0xFF
//    [6] active_status    = ((0xFF - x) >> 4) & 0x01
//    [7-8] constant FF FF (terminaison)
//
//  La partie AVANT les 9B = état/config machine (consigne, mode — à décoder)
#define FRAME_IDLE_BYTE       0x01  // séparateur inter-trames sur le bus
#define FRAME_SYNC_BYTE       0xFF  // parfois capturé isolément en début de burst
#define SENSOR_TAIL_LEN        9    // capteurs = 9 derniers octets du burst (terminé FF FF)
#define SENSOR_TEMP_MIN        5    // °C — borne basse plausible pour validation
#define SENSOR_TEMP_MAX       45    // °C — borne haute plausible pour validation

// COMMUNICATIONS PARAMETERS
#define USE_MDNS true
#define MAX_BUFFER_SIZE 195
#define MAX_MSG_SIZE 132

// IMPORT
#include <SoftwareSerial.h>
#include "RemoteDebug.h"
#include <ESP8266WiFi.h>
#include <ArduinoOTA.h>
#include <PubSubClient.h>

// COMMUNICATIONS VAR
SoftwareSerial PS;
WiFiClient wifiClient;
PubSubClient pubsubClient(wifiClient);

// DEBUGGER VAR
RemoteDebug Debug;

// TX PROBE STATE
volatile bool probe_pending = false;
static uint8_t probe_counter = 0x01;

// MQTT rate limiting — ne publie que si la valeur a changé OU toutes les 60s
static int last_water_in = -1, last_water_out = -1, last_air = -1;
static int last_coil = -1, last_gas = -1, last_power = -1, last_heating = -1;
static int last_setpoint = -1, last_setpoint_confirmed = -1;
static unsigned long last_full_publish_ms = 0;
const unsigned long MQTT_FULL_PUBLISH_INTERVAL_MS = 60000; // republish toutes les 60s

// MQTT reconnect throttle
static unsigned long mqtt_last_attempt = 0;
const unsigned long MQTT_RECONNECT_INTERVAL_MS = 5000;
// MQTT TOPICS
const char *MQTT_TOPIC_STATUS = "poolheater/status";
// MQTT VALUES
const char *MQTT_TOPIC_VALUES_WATER_IN_TEMP = "poolheater/values/water_in_temp";
const char *MQTT_TOPIC_VALUES_WATER_OUT_TEMP = "poolheater/values/water_out_temp";
const char *MQTT_TOPIC_VALUES_AIR_AMBIENT_TEMP = "poolheater/values/air_ambient_temp";
const char *MQTT_TOPIC_VALUES_COIL_TEMP = "poolheater/values/coil_temp";
const char *MQTT_TOPIC_VALUES_GAZ_TEMP = "poolheater/values/gaz_temp";
const char *MQTT_TOPIC_VALUES_ACTIVE_STATUS = "poolheater/values/active_status";
const char *MQTT_TOPIC_VALUES_HEATING = "poolheater/values/heating";
const char *MQTT_TOPIC_VALUES_SETPOINT = "poolheater/values/setpoint";
const char *MQTT_TOPIC_VALUES_SETPOINT_CONFIRMED = "poolheater/values/setpoint_confirmed";
// Partie état/config (burst long sans les 9B capteurs) — pour analyse future
const char *MQTT_TOPIC_VALUES_STATE_RAW = "poolheater/values/state_raw";
// MQTT COMMANDS
const char *MQTT_TOPIC_COMMAND_PROBE = "poolheater/command/probe";


// FUNC DECLARATIONS
void sniffing();
void processBurst(const uint8_t *burst, int len);
bool decodeSensorTail(const uint8_t *tail);
void sendProbeHB();
const char* hexDumpFast(const uint8_t *buf, int len);
void connectToMQTTBroker();
void pushMQTTMessage(const char *topic, const char *message);
void pushMQTTValue(const char *topic, int value);
void mqttReceiveCallback(char *topic, byte *payload, unsigned int length);

void setup()
{
  // MAX485 en mode réception IMMÉDIATEMENT — avant tout le reste
  // pour ne jamais corrompre le bus RS485, même si le WiFi échoue.
  pinMode(UART_RTS, OUTPUT);
  digitalWrite(UART_RTS, LOW);

  Serial.begin(115200);
  delay(1000);

  // Setting up CPU Freq
  system_update_cpu_freq(160);

  // Init WIFI
  Serial.println("**** Setup: initializing ...");
  WiFi.setOutputPower(20.5); // Full power
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  Serial.println("");

  // Waiting for Wifi to initialize (timeout 30s)
  int wifi_attempts = 0;
  while (WiFi.status() != WL_CONNECTED && wifi_attempts < 30)
  {
    delay(1000);
    Serial.print(".");
    wifi_attempts++;
  }

  if (WiFi.status() != WL_CONNECTED)
  {
    Serial.println("\nWiFi failed, restarting...");
    ESP.restart();
  }

  // Wifi Status
  Serial.println("");
  Serial.print("Connected to IP address: ");
  Serial.println(WiFi.localIP());
  WiFi.setAutoReconnect(true);
  // WiFi.persistent(true);

  // Init Debugger -- REMOTE APP : http://joaolopesf.net/remotedebugapp
  Serial.println("Remote debugger is initializing...");
  Serial.println(HOST_NAME);
  Debug.begin(HOST_NAME);
  Debug.setResetCmdEnabled(true);
  Debug.showProfiler(true);
  Debug.showColors(true);
  Serial.println("Remote debugger initialized.");

  // OTA
  ArduinoOTA.setHostname(HOST_NAME);
  ArduinoOTA.onStart([]()
                     { Serial.println("Starting OTA..."); });
  ArduinoOTA.onEnd([]()
                   { Serial.println("\nOTA Ended."); });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total)
                        { Serial.printf("Progress: %u%%\r", (progress / (total / 100))); });
  ArduinoOTA.onError([](ota_error_t error)
                     {
    Serial.printf("Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) Serial.println("Auth Failed");
    else if (error == OTA_BEGIN_ERROR) Serial.println("Begin Failed");
    else if (error == OTA_CONNECT_ERROR) Serial.println("Connect Failed");
    else if (error == OTA_RECEIVE_ERROR) Serial.println("Receive Failed");
    else if (error == OTA_END_ERROR) Serial.println("End Failed"); });
  ArduinoOTA.begin();

  // Init MQTT
  pubsubClient.setServer(MQTT_BROKER_ADDR, 1883);
  pubsubClient.setCallback(mqttReceiveCallback);
  pubsubClient.setBufferSize(512);
  connectToMQTTBroker();

  // Init UART Protocol
  Serial.println("UART Protocol is initializing...");
  PS.begin(PORT_SPEED, SWSERIAL_8N1, UART_RX, UART_TX, false);
  Serial.println("UART Protocol is listening...");
}

// Flag indiquant que le bus est en idle (dernier traitement a fini sur des 0x01)
static bool bus_is_idle = false;

void loop()
{
  // Donner du temps au WiFi quand le bus est en idle (entre les trames).
  // On ne coupe JAMAIS le RX en plein milieu d'une trame.
  static unsigned long last_wifi_window = 0;
  unsigned long now = millis();
  if (bus_is_idle && (now - last_wifi_window >= 50))
  {
    last_wifi_window = now;
    PS.enableRx(false);
    delay(3); // 3ms WiFi window pendant l'idle bus
    PS.enableRx(true);
  }

  Debug.handle();
  ArduinoOTA.handle();

  if (WiFi.status() != WL_CONNECTED)
  {
    Serial.println("WIFI disconnected. Restarting ESP");
    ESP.restart();
  }

  if (!pubsubClient.connected())
  {
    if (millis() - mqtt_last_attempt > MQTT_RECONNECT_INTERVAL_MS)
      connectToMQTTBroker();
  }

  pubsubClient.loop();

  // Si un probe est en attente, l'envoyer maintenant
  if (probe_pending)
  {
    sendProbeHB();
  }

  // sniffing UART
  sniffing();
}

// Retourne un dump hexadécimal lisible d'un buffer (buffer statique, pas d'allocation heap).
static char hex_buf[768]; // max 250 bytes * 3 chars + null
const char* hexDumpFast(const uint8_t *buf, int len)
{
  int pos = 0;
  for (int i = 0; i < len && pos < (int)sizeof(hex_buf) - 4; i++)
  {
    pos += snprintf(hex_buf + pos, sizeof(hex_buf) - pos, "%02X ", buf[i]);
  }
  if (pos > 0) hex_buf[pos - 1] = '\0'; // enlève le dernier espace
  else hex_buf[0] = '\0';
  return hex_buf;
}

