gclem/esp8266_poolex_heatpump_controller/src/main.cpp
// Buffer résiduel — conserve les bytes non terminés entre les appels readBytes.
static uint8_t residual[300];
static int residual_len = 0;
static unsigned long residual_last_activity = 0;
const unsigned long RESIDUAL_TIMEOUT_MS = 100; // flush si pas de nouvelles données pendant 100ms

// Lit le bus RS485 et découpe le flux en bursts (séquences non-0x01).
// Accumule les bytes dans un buffer résiduel pour gérer les trames coupées.
// Limite la fréquence de traitement pour laisser le WiFi stack respirer.
void sniffing()
{
  const int READ_SIZE = 250;
  uint8_t buf[READ_SIZE];

  // Mini-throttle : lire au minimum toutes les 5ms pour accumuler des bytes
  // (~5 bytes à 9600 baud) au lieu de lire byte par byte
  static unsigned long last_read_ms = 0;
  unsigned long now = millis();

  int avail = PS.available();
  if (avail <= 0)
  {
    // Si le residual stagne sans terminateur, forcer le traitement
    if (residual_len > 0 && (now - residual_last_activity) > RESIDUAL_TIMEOUT_MS)
    {
      if (residual_len >= 3)
        processBurst(residual, residual_len);
      residual_len = 0;
    }
    bus_is_idle = (residual_len == 0);
    return;
  }

  // Ne lire que si au moins 5ms écoulées OU buffer > 20 bytes
  if (avail < 20 && (now - last_read_ms) < 5) return;

  last_read_ms = now;
  bus_is_idle = false;
  residual_last_activity = now;

  // Lire uniquement ce qui est disponible — ne jamais bloquer
  int to_read = min(avail, READ_SIZE);
  int size = PS.readBytes((char *)buf, to_read);
  if (size <= 0) return;

  debugV("raw(%d): %s", size, hexDumpFast(buf, size));

  // Ajoute les nouvelles données au buffer résiduel
  int copy_len = min(size, (int)(sizeof(residual) - residual_len));
  memcpy(residual + residual_len, buf, copy_len);
  residual_len += copy_len;

  // Traite les bursts complets (terminés par au moins un 0x01)
  int i = 0;
  int last_processed = 0;

  while (i < residual_len)
  {
    // Sauter les idle bytes
    while (i < residual_len && residual[i] == FRAME_IDLE_BYTE) i++;
    if (i >= residual_len) { last_processed = i; break; }

    int burst_start = i;
    while (i < residual_len && residual[i] != FRAME_IDLE_BYTE) i++;

    if (i >= residual_len)
    {
      // Pas de 0x01 trouvé après ce burst → incomplet, garder pour la prochaine lecture
      last_processed = burst_start;
      break;
    }

    // Burst complet (suivi d'un 0x01)
    int burst_len = i - burst_start;
    if (burst_len >= 3)
      processBurst(residual + burst_start, burst_len);

    last_processed = i;
    yield(); // laisser le WiFi stack traiter entre chaque burst
  }

  // Compacte le résiduel : garde uniquement les bytes non traités
  if (last_processed > 0)
  {
    residual_len -= last_processed;
    if (residual_len > 0)
      memmove(residual, residual + last_processed, residual_len);
  }

  // Le bus est idle si on a fini de traiter tout le residual (que des 0x01 restants ou vide)
  bus_is_idle = (residual_len == 0);

  // Sécurité : si le buffer déborde sans aucun idle byte, on le vide sans traiter
  if (residual_len >= (int)sizeof(residual) - READ_SIZE)
  {
    debugV("Residual overflow, dropping %d bytes", residual_len);
    residual_len = 0;
  }

  yield();
}

// Identifie et traite un burst selon son type.
// Rate-limit les trames non reconnues pour éviter de saturer le debug/WiFi.
static unsigned long last_unknown_log_ms = 0;
static int unknown_count_since_log = 0;

void processBurst(const uint8_t *burst, int len)
{
  // Heartbeat télécommande → PAC : XX [04|0C] FF ... (12B)
  // Parfois le premier byte (counter) est perdu → 11B avec burst[0]=[04|0C]
  // byte[1]: 0x04=normal, 0x0C=commande power en cours
  // byte[4] = consigne demandée: (0xFF - x) >> 1 = °C
  // byte[3] = consigne confirmée PAC: même formule
  bool is_hb_12 = (len == 12 && (burst[1] == 0x04 || burst[1] == 0x0C) && burst[2] == 0xFF);
  bool is_hb_11 = (len == 11 && (burst[0] == 0x04 || burst[0] == 0x0C) && burst[1] == 0xFF);

  if (is_hb_12 || is_hb_11)
  {
    int offset = is_hb_11 ? -1 : 0; // décalage si counter manquant
    int setpoint_requested  = ((0xFF - burst[4 + offset]) >> 1) & 0x3F;
    int setpoint_confirmed  = ((0xFF - burst[3 + offset]) >> 1) & 0x3F;
    bool power_cmd = (burst[1 + offset] == 0x0C);
    debugD("Remote HB  : setpoint=%d°C (confirmed=%d°C) power_cmd=%d",
           setpoint_requested, setpoint_confirmed, power_cmd);
    debugV("Remote HB raw: %s", hexDumpFast(burst, len));
    bool force = (millis() - last_full_publish_ms) > MQTT_FULL_PUBLISH_INTERVAL_MS;
    if (force || setpoint_requested != last_setpoint)           { pushMQTTValue(MQTT_TOPIC_VALUES_SETPOINT, setpoint_requested);           last_setpoint = setpoint_requested; }
    if (force || setpoint_confirmed != last_setpoint_confirmed) { pushMQTTValue(MQTT_TOPIC_VALUES_SETPOINT_CONFIRMED, setpoint_confirmed); last_setpoint_confirmed = setpoint_confirmed; }
    return;
  }

  // ACK PAC → télécommande : contient F1 xx D5 et tout le reste est FF
  // Taille variable (8-13B) car parfois tronqué par le timing de lecture
  if (len >= 7 && len <= 13 && burst[1] == 0xF1 && burst[3] == 0xD5)
  {
    debugV("PAC ACK    : %s", hexDumpFast(burst, len));
    return;
  }
  // Variante tronquée : commence directement par F1
  if (len >= 6 && len <= 13 && burst[0] == 0xF1 && burst[2] == 0xD5)
  {
    debugV("PAC ACK    : %s", hexDumpFast(burst, len));
    return;
  }

  // Trames PAC data : commencent par FF, 0x00 ou 0x80 (flag byte)
  // Les 9 DERNIERS octets = capteurs (si le burst se termine par ... FF [status] FF FF)
  // tail[5]=FF est à burst[len-4], tail[7]=FF à burst[len-2], tail[8]=FF à burst[len-1]
  if (burst[0] == FRAME_SYNC_BYTE || burst[0] == 0x00 || burst[0] == 0x80)
  {
    bool has_sensor_tail = (len >= SENSOR_TAIL_LEN) &&
                           (burst[len - 1] == 0xFF) &&
                           (burst[len - 2] == 0xFF) &&
                           (burst[len - 4] == 0xFF);  // tail[5]=FF constant

    if (has_sensor_tail)
    {
      int sensor_start = len - SENSOR_TAIL_LEN;

      // Décoder les capteurs (9B en fin)
      if (!decodeSensorTail(burst + sensor_start))
        debugV("Sensor INVALID: %s", hexDumpFast(burst + sensor_start, SENSOR_TAIL_LEN));

      // La partie avant = flags + état/config machine
      // Publier en hex sur MQTT pour analyse des modes (chauffe/froid/auto)
      if (sensor_start > 0)
      {
        debugV("State      (%2dB): %s", sensor_start, hexDumpFast(burst, sensor_start));
        pushMQTTMessage(MQTT_TOPIC_VALUES_STATE_RAW, hexDumpFast(burst, sensor_start));
      }
    }
    else
    {
      // Mode erreur PAC (PL/no flow): trame courte avec capteurs en format réduit
      // Pattern: [00|80] [flag] [error_code] [5 temps] FF FF  (10B)
      // Aussi : les 7 derniers octets [5 temps] FF FF sont le "sensor short tail"
      bool has_short_tail = (len >= 7) &&
                            (burst[len - 1] == 0xFF) &&
                            (burst[len - 2] == 0xFF);

      if (has_short_tail && len <= 12)
      {
        // Tenter le décodage en mode court (5 temp bytes + FF + FF)
        int tail_start = len - 7;
        const uint8_t *st = burst + tail_start;
        int water_in  = ((0xFF - st[0]) >> 3) & 0x3F;
        int water_out = ((0xFF - st[4]) >> 1) & 0x3F;
        if (water_in >= SENSOR_TEMP_MIN && water_in <= SENSOR_TEMP_MAX &&
            water_out >= SENSOR_TEMP_MIN && water_out <= SENSOR_TEMP_MAX)
        {
          int air_ambient = ((0xFF - st[1]) >> 1) & 0x3F;
          int coil_temp   = ((0xFF - st[2]) >> 1) & 0x3F;
          int gas_temp    = ((0xFF - st[3]) >> 1) & 0x3F;
          // En mode erreur, status = OFF (st[5]=FF, st[6]=FF → power=0)
          int power_on = 0;
          int heating  = 0;

