gclem/esp8266_poolex_heatpump_controller/src/main.cpp
          debugD("Sensor(err): water_in=%d°C water_out=%d°C air=%d°C coil=%d°C gas=%d°C power=%d heating=%d",
                 water_in, water_out, air_ambient, coil_temp, gas_temp, power_on, heating);

          // Publier les valeurs
          bool force = (millis() - last_full_publish_ms) > MQTT_FULL_PUBLISH_INTERVAL_MS;
          if (force) last_full_publish_ms = millis();
          if (force || water_in != last_water_in)   { pushMQTTValue(MQTT_TOPIC_VALUES_WATER_IN_TEMP, water_in);     last_water_in = water_in; }
          if (force || water_out != last_water_out) { pushMQTTValue(MQTT_TOPIC_VALUES_WATER_OUT_TEMP, water_out);   last_water_out = water_out; }
          if (force || air_ambient != last_air)     { pushMQTTValue(MQTT_TOPIC_VALUES_AIR_AMBIENT_TEMP, air_ambient); last_air = air_ambient; }
          if (force || coil_temp != last_coil)      { pushMQTTValue(MQTT_TOPIC_VALUES_COIL_TEMP, coil_temp);         last_coil = coil_temp; }
          if (force || gas_temp != last_gas)        { pushMQTTValue(MQTT_TOPIC_VALUES_GAZ_TEMP, gas_temp);           last_gas = gas_temp; }
          if (force || power_on != last_power)      { pushMQTTValue(MQTT_TOPIC_VALUES_ACTIVE_STATUS, power_on);      last_power = power_on; }
          if (force || heating != last_heating)     { pushMQTTValue(MQTT_TOPIC_VALUES_HEATING, heating);             last_heating = heating; }
        }
        else
        {
          debugV("PAC-err    (%2dB): %s", len, hexDumpFast(burst, len));
        }
      }
      else
      {
        // Burst sans terminaison FF FF — état machine (mode erreur ou config)
        debugV("PAC-state  (%2dB): %s", len, hexDumpFast(burst, len));
        if (len >= 10) // assez de données pour être intéressant
          pushMQTTMessage(MQTT_TOPIC_VALUES_STATE_RAW, hexDumpFast(burst, len));
      }
    }
    return;
  }

  // Trame courte (flags isolés, 0x40 flooding en mode erreur)
  if (len <= 4)
  {
    debugV("Short(%dB)  : %s", len, hexDumpFast(burst, len));
    return;
  }

  // Burst de 0x40 (signal erreur PAC, mode PL) — ignorer silencieusement
  if (burst[0] == 0x40)
  {
    debugV("PAC-alert  (%2dB): 0x40 flood", len);
    return;
  }

  // Sensor tail isolé (7B en mode erreur: 5 temps + FF FF, sans header)
  if (len == 7 && burst[len - 1] == 0xFF && burst[len - 2] == 0xFF)
  {
    int water_in  = ((0xFF - burst[0]) >> 3) & 0x3F;
    int water_out = ((0xFF - burst[4]) >> 1) & 0x3F;
    if (water_in >= SENSOR_TEMP_MIN && water_in <= SENSOR_TEMP_MAX &&
        water_out >= SENSOR_TEMP_MIN && water_out <= SENSOR_TEMP_MAX)
    {
      int air_ambient = ((0xFF - burst[1]) >> 1) & 0x3F;
      int coil_temp   = ((0xFF - burst[2]) >> 1) & 0x3F;
      int gas_temp    = ((0xFF - burst[3]) >> 1) & 0x3F;
      debugD("Sensor(iso): water_in=%d°C water_out=%d°C air=%d°C coil=%d°C gas=%d°C",
             water_in, water_out, air_ambient, coil_temp, gas_temp);
      // Publier (power=off en mode erreur)
      bool force = (millis() - last_full_publish_ms) > MQTT_FULL_PUBLISH_INTERVAL_MS;
      if (force) last_full_publish_ms = millis();
      if (force || water_in != last_water_in)   { pushMQTTValue(MQTT_TOPIC_VALUES_WATER_IN_TEMP, water_in);     last_water_in = water_in; }
      if (force || water_out != last_water_out) { pushMQTTValue(MQTT_TOPIC_VALUES_WATER_OUT_TEMP, water_out);   last_water_out = water_out; }
      if (force || air_ambient != last_air)     { pushMQTTValue(MQTT_TOPIC_VALUES_AIR_AMBIENT_TEMP, air_ambient); last_air = air_ambient; }
      if (force || coil_temp != last_coil)      { pushMQTTValue(MQTT_TOPIC_VALUES_COIL_TEMP, coil_temp);         last_coil = coil_temp; }
      if (force || gas_temp != last_gas)        { pushMQTTValue(MQTT_TOPIC_VALUES_GAZ_TEMP, gas_temp);           last_gas = gas_temp; }
      if (force || 0 != last_power)             { pushMQTTValue(MQTT_TOPIC_VALUES_ACTIVE_STATUS, 0);             last_power = 0; }
      if (force || 0 != last_heating)           { pushMQTTValue(MQTT_TOPIC_VALUES_HEATING, 0);                   last_heating = 0; }
      return;
    }
  }

  // Sensor tail isolé (9B, terminé FF FF, sans flag en tête)
  if (len == SENSOR_TAIL_LEN && burst[len - 1] == 0xFF && burst[len - 2] == 0xFF && burst[len - 4] == 0xFF)
  {
    if (!decodeSensorTail(burst))
      debugV("SensorIso INVALID: %s", hexDumpFast(burst, len));
    return;
  }

  // Trame non reconnue — rate-limited pour ne pas saturer
  unknown_count_since_log++;
  unsigned long now = millis();
  if (now - last_unknown_log_ms > 2000)
  {
    if (unknown_count_since_log > 1) {
      debugD("Unknown    : %d trames non reconnues en 2s (dernière %dB: %s)",
             unknown_count_since_log, len, hexDumpFast(burst, min(len, 16)));
    } else {
      debugV("Unknown    (%2dB): %s", len, hexDumpFast(burst, len));
    }
    last_unknown_log_ms = now;
    unknown_count_since_log = 0;
  }
}

// Décode les 9 octets capteurs (fin de burst, terminés FF FF).
// Formules confirmées avec mesures réelles (eau=17°C, air=15°C, mai 2026).
bool decodeSensorTail(const uint8_t *tail)
{
  int water_in    = ((0xFF - tail[0]) >> 3) & 0x3F;
  int air_ambient = ((0xFF - tail[1]) >> 1) & 0x3F;
  int coil_temp   = ((0xFF - tail[2]) >> 1) & 0x3F;
  int gas_temp    = ((0xFF - tail[3]) >> 1) & 0x3F;
  int water_out   = ((0xFF - tail[4]) >> 1) & 0x3F;
  // tail[5] = 0xFF constant
  // tail[6] status bits: inv=0x16(on+heating) vs inv=0x10(on+standby)
  uint8_t status_inv = 0xFF - tail[6];
  int power_on    = (status_inv >> 4) & 0x01;  // bit4 = power
  int heating     = (status_inv >> 1) & 0x01;  // bit1 = compressor/heating
  // tail[7-8] = FF FF terminaison

  if (water_in  < SENSOR_TEMP_MIN || water_in  > SENSOR_TEMP_MAX) return false;
  if (water_out < SENSOR_TEMP_MIN || water_out > SENSOR_TEMP_MAX) return false;

  debugD("Sensor     : water_in=%d°C water_out=%d°C air=%d°C coil=%d°C gas=%d°C power=%d heating=%d",
         water_in, water_out, air_ambient, coil_temp, gas_temp, power_on, heating);

  // Force republish toutes les 60s même si les valeurs n'ont pas changé
  bool force = (millis() - last_full_publish_ms) > MQTT_FULL_PUBLISH_INTERVAL_MS;
  if (force) last_full_publish_ms = millis();

