gclem/esp8266_poolex_heatpump_controller/src/main.cpp
  if (force || water_in != last_water_in)    { pushMQTTValue(MQTT_TOPIC_VALUES_WATER_IN_TEMP,    water_in);    last_water_in = water_in; }
  if (force || water_out != last_water_out)  { pushMQTTValue(MQTT_TOPIC_VALUES_WATER_OUT_TEMP,   water_out);   last_water_out = water_out; }
  if (force || air_ambient != last_air)      { pushMQTTValue(MQTT_TOPIC_VALUES_AIR_AMBIENT_TEMP, air_ambient); last_air = air_ambient; }
  if (force || coil_temp != last_coil)       { pushMQTTValue(MQTT_TOPIC_VALUES_COIL_TEMP,        coil_temp);   last_coil = coil_temp; }
  if (force || gas_temp != last_gas)         { pushMQTTValue(MQTT_TOPIC_VALUES_GAZ_TEMP,         gas_temp);    last_gas = gas_temp; }
  if (force || power_on != last_power)       { pushMQTTValue(MQTT_TOPIC_VALUES_ACTIVE_STATUS,    power_on);    last_power = power_on; }
  if (force || heating != last_heating)      { pushMQTTValue(MQTT_TOPIC_VALUES_HEATING,          heating);     last_heating = heating; }
  return true;
}

// --- TX Probe ---
// Envoie un HB de "2ème télécommande" pour tester si la PAC répond.
// Format identique au HB observé, mais avec un ID différent (0x6_ au lieu de 0x5_).

void sendProbeHB()
{
  // HB template basé sur l'observation: XX 04 FF C7 C7 C9 FB FF AF DD 0B FD
  // On utilise 0x6_ comme ID de "2ème télécommande"
  uint8_t hb[12] = {
    (uint8_t)(0x60 | (probe_counter & 0x0F)),  // ID=0x6_ + counter
    0x04,  // keepalive normal
    0xFF,
    0xC7,  // consigne confirmée (28°C par défaut)
    0xC7,  // consigne demandée (28°C par défaut)
    0xC9,
    0xFB,
    0xFF,
    0xAF,
    0xDD,
    0x0B,
    0xFD
  };

  probe_counter += 2;  // incrémente comme la vraie télécommande

  debugI("TX PROBE: %s", hexDumpFast(hb, 12));

  // Basculer MAX485 en TX
  digitalWrite(UART_RTS, HIGH);
  delayMicroseconds(100);

  // Envoyer le HB
  PS.write(hb, 12);
  PS.flush();

  // Attendre fin de transmission: 12 bytes * 10 bits / 9600 baud ≈ 12.5ms
  delay(15);

  // Repasser en RX
  digitalWrite(UART_RTS, LOW);

  debugI("TX PROBE sent, listening for PAC response...");
  probe_pending = false;
}

void connectToMQTTBroker()
{
  mqtt_last_attempt = millis();

  if (!pubsubClient.connected())
  {
    Debug.printf("Connecting to MQTT Broker as %s.....\n", HOST_NAME);
    if (pubsubClient.connect(HOST_NAME, HOST_NAME, HOST_NAME))
    {
      Debug.println("Connected to MQTT broker.");
      pubsubClient.publish(MQTT_TOPIC_STATUS, "ON", true);
      pubsubClient.subscribe(MQTT_TOPIC_COMMAND_PROBE);
    }
    else
    {
      Debug.print("Failed to connect to MQTT broker, rc=");
      Debug.print(pubsubClient.state());
      Debug.println(" — retrying in 5s");
    }
  }
}

void pushMQTTMessage(const char *topic, const char *msg)
{
  if (!pubsubClient.connected())
  {
    debugE("Pubsub client not connected - avoiding to push message %s : %s", topic, msg);
  }
  else
  {
    pubsubClient.publish(topic, msg);
  }
}

void pushMQTTValue(const char *topic, int value)
{
  if (!pubsubClient.connected())
  {
    debugE("Pubsub client not connected - avoiding to push values.");
  }
  else
  {
    pubsubClient.publish(String(topic).c_str(), String(value).c_str());
  }
}

void mqttReceiveCallback(char *topic, byte *payload, unsigned int length)
{
  debugV("Receiving new message from MQTT from %s, value size: %d", topic, length);

  if(strcmp(topic, MQTT_TOPIC_COMMAND_PROBE) == 0)
  {
    debugI("PROBE command received — will send test HB on next loop");
    probe_pending = true;
  }
}